import { z } from 'zod';

export const productSchema = z.object({
  title: z
    .string()
    .min(3, 'Назва виробу повинна містити мінімум 3 символи')
    .max(100, 'Назва виробу повинна бути не більше 100 символів'),
  price: z
    .number({ invalid_type_error: 'Ціна повинна бути числом' })
    .min(0, 'Ціна не може бути від’ємною'),
  description: z
    .string()
    .min(10, 'Опис повинен містити мінімум 10 символів')
    .max(1000, 'Опис повинен бути не більше 3000 символів'),
  tags: z
    .string()
    .min(2, 'Тег повинен містити мінімум 2 символи')
    .max(50, 'Тег повинен бути не більше 20 символів'),
  files: z
    .array(z.instanceof(File))
    .min(1, 'Потрібно додати як мінімум 1 зображення')
});
