export const categories = [
    {
      id: 1,
      name: 'Меблі для вітальні',
      subcategories: [
        { id: 11, name: 'Дивани, крісла, пуфи', title: 'диван,крісло,пуф' },
        { id: 12, name: 'Журнальні столики, ТВ-тумби', title: 'журнальний,твтумба' },
        { id: 13, name: 'Стінки, секційні меблі для зберігання', title: 'стінка,шафа,шафа-купе' },
      ],
    },
    {
      id: 2,
      name: 'Меблі для спальні',
      subcategories: [
        { id: 21, name: 'Ліжка, тумбочки', title: 'ліжко,тумба' },
        { id: 22, name: 'Шафи для одягу, комоди', title: 'шафа-купе,комод' },
        { id: 23, name: 'Туалетні столики, дзеркала', title: 'письмовий,туалетний,дзеркала' },
        { id: 24, name: 'Гардеробні системи', title: 'шафа,шафа-купе' },
      ],
    },
    {
      id: 3,
      name: 'Меблі для кухні',
      subcategories: [
        { id: 31, name: 'Кухонні столи, стільці', title: 'кухня,стілець' },
        { id: 32, name: 'Шафки, кухонні гарнітури', title: 'кухня,шафки' },
        { id: 33, name: 'Барні стійки, табурети', title: 'барні-стійки,стілець,табурет' },
        { id: 34, name: 'Буфети, серванти', title: 'Буфет,сервант' },
      ],
    },
    {
      id: 4,
      name: 'Меблі для кабінету',
      subcategories: [
        { id: 41, name: 'Робочі столи', title: "комп%27ютерний" },
        { id: 42, name: 'Офісні крісла, стільці', title: 'крісло,стілець' },
        { id: 43, name: 'Шафи та полиці для документів', title: 'полиця' },
      ],
    },
    {
      id: 5,
      name: 'Меблі для передпокоїв',
      subcategories: [
        { id: 51, name: 'Вішалки для одягу', title: 'вішалка,предпокій' },
        { id: 52, name: 'Шафи для взуття', title: 'предпокій' },
        { id: 53, name: 'Дзеркала, полички для ключів', title: 'полиця' },
      ],
    }
  ];