// Функція для перетворення query у формат заголовка
export const formatTitle = (query: string | null) => {
    if (!query) return { main: 'Меблі', styledPart: '' }; // Заголовок за замовчуванням, якщо query немає

    const mapping: { [key: string]: { main: string; styledPart: string } } = {
      'диван,крісло,пуф': { main: 'Меблі для вітальні | ', styledPart: 'дивани крісла пуфи' },
      'журнальний,твтумба': { main: 'Меблі для вітальні | ', styledPart: 'Журнальні столики ТВ-тумби' },
      'стінка,шафа,шафа-купе': { main: 'Меблі для вітальні | ', styledPart: 'Стінки, секційні меблі для зберігання' },
      'ліжко,тумба': { main: 'Меблі для спальні | ', styledPart: 'Ліжка, тумбочки' },
      'шафа-купе,комод': { main: 'Меблі для спальні | ', styledPart: 'Шафи для одягу, комоди' },
      'письмовий,туалетний,дзеркала': { main: 'Меблі для спальні | ', styledPart: 'Туалетні столики, дзеркала' },
      'шафа,шафа-купе': { main: 'Меблі для спальні | ', styledPart: 'Гардеробні системи' },
      'кухня,стілець': { main: 'Меблі для кухні | ', styledPart: 'Кухонні столи, стільці' },
      'кухня,шафки': { main: 'Меблі для кухні | ', styledPart: 'Шафки, кухонні гарнітури' },
      'барні-стійки,стілець,табурет': { main: 'Меблі для кухні | ', styledPart: 'Барні стійки, табурети' },
      'Буфет,сервант': { main: 'Меблі для кухні | ', styledPart: 'Буфети, серванти' },
      "комп'ютерний": { main: 'Меблі для кабінету | ', styledPart: 'Робочі столи' },
      'крісло,стілець': { main: 'Меблі для кабінету | ', styledPart: 'Офісні крісла, стільці' },
      'полиця': { main: 'Меблі для кабінету | ', styledPart: 'Шафи та полиці для документів' },
      'вішалка,предпокій': { main: 'Меблі для передпокоїв | ', styledPart: 'Вішалки для одягу' },
      'предпокій': { main: 'Меблі для передпокоїв | ', styledPart: 'Шафи для взуття' },
      // Додайте інші значення для різних query
    };

    return mapping[query] || { main: 'Меблі', styledPart: '' }; // Якщо query не знайдено у мапінгу, показуємо заголовок за замовчуванням
  };